Catalogs/ИА_БПКартыМаршрутов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_БПКартыМаршрутов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Карта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутЗадач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПМаршрутЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИА_БПТочкиМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_БПТочкиМаршрута</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИА_БПКартыМаршрутов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПТипыТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВКарте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПТипыАдресацииЗадач</v8:Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПВариантыДней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммнаяОбработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинияДляУсловияИстинно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинияДляУсловияЛожно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоУведомление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутЗадачВложенногоБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПМаршрутЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПТипыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвращатьАвторуНаПроверку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходящиеЛинии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_БПТочкиМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вариант</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Обработчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПСобытияТочекБП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПВариантыОбработчиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеквизитыВложенногоБП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_БПРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособЗаполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПСпособыЗаполненияДопРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ИА_БПРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыводимыеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_БПРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОчищатьПриСозданииЗадачи</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтролироватьЗаполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоПросмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИА_БПКартыМаршрутов/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
    Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
    
    Если НЕ ЭтоНовый() Тогда
    	КартаСтарая = ЭтотОбъект.Ссылка.Карта.Получить();
        КартаНовая  = ЭтотОбъект.Карта.Получить();
        
        Если КартаСтарая <> Неопределено И КартаНовая <> Неопределено Тогда
        	КартаБылаОчищена = КартаСтарая.ЭлементыГрафическойСхемы.Количество() > 4
            И КартаНовая.ЭлементыГрафическойСхемы.Количество() = 0;
            
            Если КартаБылаОчищена Тогда
            	ИА_БФКС.СообщениеОбОшибке("Невозможно записать пустую карту маршрута, если в ней были элементы!", Отказ); 
            КонецЕсли; 
        КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
    Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
    
    // 1) Пометим на удаление существующие
    ИА_Защита_НФ.КМ_ПометитьНаУдалениеВсеЭлементы(Ссылка);
    
    Схема = Карта.Получить();
    Если Схема <> Неопределено Тогда
        ИА_Защита_НФ.КМ_РаспарситьКартуМаршрута(Схема, Ссылка);
    КонецЕсли; 
    
    Если ДополнительныеСвойства.Свойство("ИА_ОбъектКопирования") Тогда
        ВыполнитьПереносДанныхТочекСОбъектаКопирования(ДополнительныеСвойства.ИА_ОбъектКопирования);
        ДополнительныеСвойства.Удалить("ИА_ОбъектКопирования");
    КонецЕсли; 
КонецПроцедуры    

Процедура ПриКопировании(ОбъектКопирования)
    Если ТипЗнч(ОбъектКопирования) = Тип("СправочникСсылка.ИА_БПКартыМаршрутов") Тогда
        ДополнительныеСвойства.Вставить("ИА_ОбъектКопирования", ОбъектКопирования);
    КонецЕсли; 
КонецПроцедуры

Процедура ВыполнитьПереносДанныхТочекСОбъектаКопирования(КартаМаршрутаИсходная)
    // Перенесем данные "точек"
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   ИА_БПТочкиМаршрута.Ссылка КАК Точка
    |ИЗ
    |   Справочник.ИА_БПТочкиМаршрута КАК ИА_БПТочкиМаршрута
    |ГДЕ
    |   НЕ ИА_БПТочкиМаршрута.ПометкаУдаления
    |   И ИА_БПТочкиМаршрута.Владелец = &КартаТекущая
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ  *
    | ИЗ
    |   Справочник.ИА_БПТочкиМаршрута КАК ИА_БПТочкиМаршрута
    |ГДЕ
    |   НЕ ИА_БПТочкиМаршрута.ПометкаУдаления
    |   И ИА_БПТочкиМаршрута.Владелец = &КартаКопирования";
    Запрос.УстановитьПараметр("КартаКопирования", КартаМаршрутаИсходная);
    Запрос.УстановитьПараметр("КартаТекущая", Ссылка);
    Пакет = Запрос.ВыполнитьПакет();
    
    ТочкиКопирования = Пакет[1].Выгрузить();
    
    Выборка = Пакет[0].Выбрать();
    Пока Выборка.Следующий() Цикл
        Спр = Выборка.Точка.ПолучитьОбъект();
        НайдСтрока = ТочкиКопирования.Найти(Спр.Имя, "Имя");
        Если НайдСтрока <> Неопределено Тогда
            ЗаполнитьЗначенияСвойств(Спр, НайдСтрока,, "Код, Наименование, Владелец, Тип, Имя");
            ИменаТЧДляКопирования = Новый Структура("Обработчики, РеквизитыВложенногоБП, ВыводимыеРеквизиты");
            Для каждого КиЗ Из ИменаТЧДляКопирования Цикл
            	Спр[КиЗ.Ключ].Загрузить(НайдСтрока[КиЗ.Ключ]);
            КонецЦикла; 
        КонецЕсли; 
        Спр.Записать();
    КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
    Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ИА_БПКартыМаршрутов") Тогда
        СтандартнаяОбработка = Ложь;
        ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Код, Наименование, Владелец");
        ДополнительныеСвойства.Вставить("ИА_ОбъектКопирования", ДанныеЗаполнения);
    КонецЕсли; 
КонецПроцедуры
